# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [3]:
series_1 = pd.Series(lst)
series_1

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [4]:
series_1[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [5]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [6]:


df_1 = pd.DataFrame(b)
df_1

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [9]:
df_1.rename(columns = {0:"Score_1",1:"Score_2",2:"Score_3",3:"Score_4",4:"Score_5"}, inplace= True)
df_1.head(10)

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [10]:
subset_1 = df_1[["Score_1","Score_3","Score_5"]]
subset_1.head()

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9

### 7. From the original data frame, calculate the average Score_3 value.

In [11]:
print("The average of the Score_3 values is: ",round(df_1["Score_3"].mean(),3))

The average of the Score_3 values is:  56.95

### 8. From the original data frame, calculate the maximum Score_4 value.

In [12]:
print("The maximum of the Score_4 values is: ",round(df_1["Score_4"].max(),3))

The maximum of the Score_4 values is:  88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [13]:
print("The median of the Score_2 values is: ",round(df_1["Score_2"].median(),3))

The median of the Score_2 values is:  40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [14]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [15]:
df_orders = pd.DataFrame(orders)
df_orders.sample()

                Description  Quantity  UnitPrice  Revenue
8  JAZZ HEARTS ADDRESS BOOK        10       0.19      1.9

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [16]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Description  10 non-null     object
 1   Quantity     10 non-null     int64
 2   UnitPrice    10 non-null     float64
 3   Revenue      10 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 448.0+ bytes

In [17]:
quantity_ordered = df_orders["Quantity"].sum()
revenue_generated = df_orders["Revenue"].sum()

print(f"Qauntity sold was {quantity_ordered} and revenue generated was {revenue_generated} EUR")

Qauntity sold was 2978 and revenue generated was 637.0 EUR

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [18]:
df_orders

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

In [19]:
most_expensive = df_orders["UnitPrice"].max()
least_expensive = df_orders["UnitPrice"].min()

print(f"Most expensive item was {most_expensive} and the least expensive one was {least_expensive}")

Most expensive item was 11.95 and the least expensive one was 0.18

## Let's load another dataset for more exercisesº

In [20]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [21]:
print(admissions.head(10))
print("df shape is: ",admissions.shape)

   Serial No.  GRE Score  TOEFL Score  University Rating  SOP  LOR  CGPA  \
0           1        337          118                  4  4.5  4.5  9.65
1           2        316          104                  3  3.0  3.5  8.00
2           3        322          110                  3  3.5  2.5  8.67
3           4        314          103                  2  2.0  3.0  8.21
4           5        330          115                  5  4.5  3.0  9.34
5           6        321          109                  3  3.0  4.0  8.20
6           7        308          101                  2  3.0  4.0  7.90
7           8        302          102                  1  2.0  1.5  8.00
8           9        323          108                  3  3.5  3.0  8.60
9          10        327          111                  4  4.0  4.5  9.00

   Research  Chance of Admit
0         1             0.92
1         1             0.72
2         1             0.80
3         0             0.65
4         1             0.90
5         1             0.75
6         0             0.68
7         0             0.50
8         0             0.45
9         1             0.84
df shape is:  (385, 9)

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [22]:
admissions.isnull().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [23]:
admissions.set_index(["Serial No."],drop=False,inplace=True)
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
2,2,316,104,3,3.0,3.5,8.00,1,0.72
3,3,322,110,3,3.5,2.5,8.67,1,0.80
4,4,314,103,2,2.0,3.0,8.21,0,0.65
5,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
381,381,324,110,3,3.5,3.5,9.04,1,0.82
382,382,325,107,3,3.0,3.5,9.11,1,0.84
383,383,330,116,4,5.0,4.5,9.45,1,0.91
384,384,312,103,3,3.5,4.0,8.78,0,0.67
385,385,333,117,4,5.0,4.0,9.66,1,0.95

Do` and `CGPA` also uniquely identify the data? Show this in the cell below.

In [24]:
print("CGPA: ",admissions.value_counts("CGPA"))

print("GRE Score: ",admissions.value_counts("GRE Score"))

#print("CGPA --->",admissions["CGPA"].unique())
#print("GRE Score --->",admissions["GRE Score"].unique())

print("As you can see the elements are not unique")

CGPA:  CGPA
8.00    9
8.64    6
8.56    6
8.76    6
8.67    5
       ..
8.49    1
8.32    1
8.28    1
8.25    1
9.92    1
Length: 168, dtype: int64
GRE Score:  GRE Score
312    16
324    16
322    14
314    14
321    13
316    12
317    12
320    12
327    12
313    11
311    11
325    11
308    11
315    10
323    10
326    10
319     9
300     9
329     9
318     9
307     8
304     8
310     8
301     8
299     8
331     8
334     7
340     7
298     7
305     7
330     6
332     6
328     6
306     6
302     5
303     5
296     5
309     5
336     5
297     4
338     4
295     4
333     4
335     4
339     3
290     2
294     2
337     1
293     1
dtype: int64
As you can see the elements are not unique

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [25]:
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
2,2,316,104,3,3.0,3.5,8.00,1,0.72
3,3,322,110,3,3.5,2.5,8.67,1,0.80
4,4,314,103,2,2.0,3.0,8.21,0,0.65
5,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
381,381,324,110,3,3.5,3.5,9.04,1,0.82
382,382,325,107,3,3.0,3.5,9.11,1,0.84
383,383,330,116,4,5.0,4.5,9.45,1,0.91
384,384,312,103,3,3.5,4.0,8.78,0,0.67
385,385,333,117,4,5.0,4.0,9.66,1,0.95

In [26]:
CGPA_9 = admissions["CGPA"] > 9 
investigation = admissions["Research"] == True

first_filter = admissions[CGPA_9 & investigation]


print("Number of rows of the new filtered df is: ",len(first_filter))

Number of rows of the new filtered df is:  101

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [27]:
sop = admissions["SOP"] < 3.5

second_filter = admissions[CGPA_9 & sop]
chance_of_admit_mean = round(second_filter["Chance of Admit"].mean(),5) * 100

print(f"The mean chance of admit for the filtered applicants is {chance_of_admit_mean} %")

The mean chance of admit for the filtered applicants is 80.2 %

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [28]:
def toefl_bool(x):
    if x > 100:
        return True
    else:
        return False

In [29]:
toefl_bool(110)

True

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [30]:
# df["quantity_2"] = df["quantity"].apply(lambda x: str(x/10)[:4] + " €")

admissions["Decision"] = admissions["TOEFL Score"].apply(toefl_bool)
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision
Serial No.,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,True
2,2,316,104,3,3.0,3.5,8.00,1,0.72,True
3,3,322,110,3,3.5,2.5,8.67,1,0.80,True
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True
5,5,330,115,5,4.5,3.0,9.34,1,0.90,True
...,...,...,...,...,...,...,...,...,...,...
381,381,324,110,3,3.5,3.5,9.04,1,0.82,True
382,382,325,107,3,3.0,3.5,9.11,1,0.84,True
383,383,330,116,4,5.0,4.5,9.45,1,0.91,True
384,384,312,103,3,3.5,4.0,8.78,0,0.67,True
385,385,333,117,4,5.0,4.0,9.66,1,0.95,True

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [31]:
# Ejamplo para apply + lambda: https://sparkbyexamples.com/pandas/pandas-apply-with-lambda-examples/

admissions["decision2"] = admissions["SOP"].apply(lambda x: 1 if x > 3 else 0)
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision,decision2
Serial No.,,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,True,1
2,2,316,104,3,3.0,3.5,8.00,1,0.72,True,0
3,3,322,110,3,3.5,2.5,8.67,1,0.80,True,1
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True,0
5,5,330,115,5,4.5,3.0,9.34,1,0.90,True,1
...,...,...,...,...,...,...,...,...,...,...,...
381,381,324,110,3,3.5,3.5,9.04,1,0.82,True,1
382,382,325,107,3,3.0,3.5,9.11,1,0.84,True,0
383,383,330,116,4,5.0,4.5,9.45,1,0.91,True,1
384,384,312,103,3,3.5,4.0,8.78,0,0.67,True,1
385,385,333,117,4,5.0,4.0,9.66,1,0.95,True,1